{
  "items": [
    {
      "creator": "Todd Thiemann",
      "title": "Maximize Your Security Stack",
      "link": "https://www.reliaquest.com/blog/maximize-security-stack/",
      "pubDate": "Fri, 01 Jul 2022 17:13:53 +0000",
      "content:encoded": "<p><a href=\"/blog/what-is-xdr-extended-detection-and-response/\">Extended detection and response</a> (XDR) is an increasingly popular option for security teams looking to boost their org’s maturity. Unfortunately, most XDR security providers only work with the set of tools they bring to the table, requiring teams with existing tools outside that list to rip and replace. It might seem like a mandatory trade-off: either improve your security operations OR keep your existing toolset—but there’s another option.</p>\n<p>With ransomware on the rise and a host of new solutions on the market, it’s easy to get caught up in buying the latest and greatest. However, once all is said and done, multiple new solutions (without a way to pull them all together) may not be the answer. <a href=\"/blog/what-is-open-xdr/\">Open XDR security</a> allows you to keep your existing tool stack, maximize and orchestrate its various capabilities, and manage it all from a centralized view.</p>\n<h2 id=\"ransomware\" class=\"toc-content__target\">The Rise of Ransomware and the Need for New Solutions</h2>\n<p>RansomOps are sophisticated new operations, taking ransomware to a new level and making attacks more long-term, dangerous, and difficult to detect than ever. These days, they’re more akin to advanced persistent threats (APTs). Using options such as ransomware as a service (RaaS), ransomware gangs are churning out more complex attacks faster. Known as “script kiddies,” these low-skill (or low-effort) baddies purchase RaaS exploits for easy implementation and mass distribution of nefarious attack campaigns. Plus, the payouts are getting higher. Last year, one <a href=\"https://www.engadget.com/acer-50-million-ransomware-attack-054534573.html?guccounter=1&amp;guce_referrer=aHR0cHM6Ly9kdWNrZHVja2dvLmNvbS8&amp;guce_referrer_sig=AQAAAKBZFXLyydfT5KrmcFsPXHoz2FfMlw_kIENP_54-tBBoey4CyoAGkZyt0mw8a__6uCFh6BJXN6tt-Im1ghge5l2EXaxN2zm8BDKDpViXT2qMYBS7vwY2a2JLkgE9XO8ot8zbiBV_C66tx040XsKxpW0Ud1GVXpi9SipBfC8W4P7b\" rel=\"nofollow noopener\" target=\"_blank\">capped $50 million</a>. If you&#8217;ve heard of the <a href=\"https://www.zdnet.com/article/colonial-pipeline-ransomware-attack-everything-you-need-to-know/\" target=\"_blank\" rel=\"noopener\">Colonial Pipeline attack</a>, you&#8217;ve heard of a RaaS-based RansomOps attack.</p>\n<p>In response to these threats, which are now more dangerous and frequent, companies have turned to new solutions. In addition to the usual antivirus software, you have next-generation antivirus (NGAV), endpoint protection platforms (EPP), cloud protection platforms (CPP), encryption solutions, network mapping, and SIEM and SOAR tools, just to name a few. So, more tools mean more protection, right? Maybe not.</p>\n<h2 id=\"sprawl\" class=\"toc-content__target\">The Tool Sprawl Dilemma</h2>\n<p>Security vendors typically don’t go <a href=\"/blog/native-vs-open-xdr-pt-1/\">“all in” on one security solution</a>, as Jason Pfeiffer, ReliaQuest Chief Strategy Officer, puts it. Says Jason, “You might use a cloud control product or endpoint software from the same firewall vendor, but what about identity management? What about external-facing applications and the web application firewalls used to protect them? Or your Secure Edge provider? Or your DNS infrastructure?” Good points. And when you do end up with the cornucopia of tools necessary to defend your enterprise against attack, the issue of managing them all is almost enough to put you under.</p>\n<p>Plus, consider the time (and manpower) it would take to run them all to complete efficiency, really getting your money’s worth out of them. For that reason, <a href=\"/resources/research-reports/2021-reliaquest-security-technology-sprawl-report/\">85% of organizations</a> report adopting security solutions faster than they can use them, and <a href=\"https://www.reliaquest.com/resources/research-reports/2021-reliaquest-security-technology-sprawl-report/\">71% say the amount of time they spend</a> trying to learn their tools inhibits them from defending against threats. In addition to draining time and resources, tool sprawl is overtly counterproductive. So, <a href=\"/blog/security-tool-sprawl-how-to-eliminate/\">what’s the solution</a>?</p>\n<h2 id=\"maximize\" class=\"toc-content__target\">How to Maximize Your Security Stack Investment</h2>\n<p>Unlike <a href=\"/blog/native-vs-open-xdr-pt-1/\">native XDR</a>, the <a href=\"/open-xdr/\">Open XDR architecture</a> allows security teams to bring the technology they’ve already worked so hard to implement into an integrated architecture, wasting nothing. You can see how <a href=\"https://www.reliaquest.com/resources/data-sheets/open-xdr-data-sheet/\">Open XDR actually improves upon the capabilities of existing tools</a>. It enables your organization to keep the tools you already have while exponentially growing your detection and response capabilities beyond the endpoint.</p>\n<p>As Jason <a href=\"/blog/native-vs-open-xdr-pt-1/\">sums up</a>, “In your day-to-day life, would you buy anything that is not compatible with the other technologies you have already invested your hard-earned money in? Would you use a Gmail account if your iPhone did not support it? You might buy Sonos because of what it offers, but you want it to work with Amazon Alexa if that is what you standardized on. Surely, you will not buy everything that is made only by Amazon, but you want a standard platform to support anything you buy.”</p>\n<p>Open XDR uses a <a href=\"/platform/\">vendor-agnostic, integrated platform</a> to provide full visibility of the attack chain, aggregate telemetry across all existing technologies, and provide the best, most comprehensive approach to enterprise security.</p>\n<h2 id=\"ReliaQuest\" class=\"toc-content__target\">ReliaQuest GreyMatter Drives Business Results</h2>\n<p>The ReliaQuest <a href=\"/platform/\">security operations platform</a>, GreyMatter, is built on an <a href=\"/open-xdr/\">Open XDR architecture</a>. It provides exponentially greater situational awareness and efficiencies within security operations. This results in better visibility, which, paired with the right context, allows security professionals to get the full picture much faster: some customers manage to cut their <a href=\"https://www.reliaquest.com/resources/research-reports/the-total-economic-impact-of-reliaquest/\">mean time to resolve (MTTR) in half</a>.</p>\n<p>GreyMatter helps teams do more with less. By leading with technology and automation, GreyMatter can significantly reduce high-time, low-brain activities, leading to a more efficient security team. Plus, in addition to collecting telemetry from your tools, we can help you ensure you’re getting the value you expect from each of them. We’ll also constantly keep them optimized, patched, and up to date.</p>\n",
      "content:encodedSnippet": "Extended detection and response (XDR) is an increasingly popular option for security teams looking to boost their org’s maturity. Unfortunately, most XDR security providers only work with the set of tools they bring to the table, requiring teams with existing tools outside that list to rip and replace. It might seem like a mandatory trade-off: either improve your security operations OR keep your existing toolset—but there’s another option.\nWith ransomware on the rise and a host of new solutions on the market, it’s easy to get caught up in buying the latest and greatest. However, once all is said and done, multiple new solutions (without a way to pull them all together) may not be the answer. Open XDR security allows you to keep your existing tool stack, maximize and orchestrate its various capabilities, and manage it all from a centralized view.\nThe Rise of Ransomware and the Need for New Solutions\nRansomOps are sophisticated new operations, taking ransomware to a new level and making attacks more long-term, dangerous, and difficult to detect than ever. These days, they’re more akin to advanced persistent threats (APTs). Using options such as ransomware as a service (RaaS), ransomware gangs are churning out more complex attacks faster. Known as “script kiddies,” these low-skill (or low-effort) baddies purchase RaaS exploits for easy implementation and mass distribution of nefarious attack campaigns. Plus, the payouts are getting higher. Last year, one capped $50 million. If you’ve heard of the Colonial Pipeline attack, you’ve heard of a RaaS-based RansomOps attack.\nIn response to these threats, which are now more dangerous and frequent, companies have turned to new solutions. In addition to the usual antivirus software, you have next-generation antivirus (NGAV), endpoint protection platforms (EPP), cloud protection platforms (CPP), encryption solutions, network mapping, and SIEM and SOAR tools, just to name a few. So, more tools mean more protection, right? Maybe not.\nThe Tool Sprawl Dilemma\nSecurity vendors typically don’t go “all in” on one security solution, as Jason Pfeiffer, ReliaQuest Chief Strategy Officer, puts it. Says Jason, “You might use a cloud control product or endpoint software from the same firewall vendor, but what about identity management? What about external-facing applications and the web application firewalls used to protect them? Or your Secure Edge provider? Or your DNS infrastructure?” Good points. And when you do end up with the cornucopia of tools necessary to defend your enterprise against attack, the issue of managing them all is almost enough to put you under.\nPlus, consider the time (and manpower) it would take to run them all to complete efficiency, really getting your money’s worth out of them. For that reason, 85% of organizations report adopting security solutions faster than they can use them, and 71% say the amount of time they spend trying to learn their tools inhibits them from defending against threats. In addition to draining time and resources, tool sprawl is overtly counterproductive. So, what’s the solution?\nHow to Maximize Your Security Stack Investment\nUnlike native XDR, the Open XDR architecture allows security teams to bring the technology they’ve already worked so hard to implement into an integrated architecture, wasting nothing. You can see how Open XDR actually improves upon the capabilities of existing tools. It enables your organization to keep the tools you already have while exponentially growing your detection and response capabilities beyond the endpoint.\nAs Jason sums up, “In your day-to-day life, would you buy anything that is not compatible with the other technologies you have already invested your hard-earned money in? Would you use a Gmail account if your iPhone did not support it? You might buy Sonos because of what it offers, but you want it to work with Amazon Alexa if that is what you standardized on. Surely, you will not buy everything that is made only by Amazon, but you want a standard platform to support anything you buy.”\nOpen XDR uses a vendor-agnostic, integrated platform to provide full visibility of the attack chain, aggregate telemetry across all existing technologies, and provide the best, most comprehensive approach to enterprise security.\nReliaQuest GreyMatter Drives Business Results\nThe ReliaQuest security operations platform, GreyMatter, is built on an Open XDR architecture. It provides exponentially greater situational awareness and efficiencies within security operations. This results in better visibility, which, paired with the right context, allows security professionals to get the full picture much faster: some customers manage to cut their mean time to resolve (MTTR) in half.\nGreyMatter helps teams do more with less. By leading with technology and automation, GreyMatter can significantly reduce high-time, low-brain activities, leading to a more efficient security team. Plus, in addition to collecting telemetry from your tools, we can help you ensure you’re getting the value you expect from each of them. We’ll also constantly keep them optimized, patched, and up to date.",
      "dc:creator": "Todd Thiemann",
      "content": "Extended detection and response (XDR) is an increasingly popular option for security teams looking to boost their org’s maturity. Unfortunately, most XDR security providers only work with the set of tools they bring to the table, requiring teams with existing tools outside that list to rip and replace. It might seem like a mandatory trade-off: [&#8230;]",
      "contentSnippet": "Extended detection and response (XDR) is an increasingly popular option for security teams looking to boost their org’s maturity. Unfortunately, most XDR security providers only work with the set of tools they bring to the table, requiring teams with existing tools outside that list to rip and replace. It might seem like a mandatory trade-off: […]",
      "guid": "https://www.reliaquest.com/?p=4695",
      "categories": [
        "Digital Risk Protection",
        "Security Operations Platform",
        "Threat Hunting"
      ],
      "isoDate": "2022-07-01T17:13:53.000Z"
    },
    {
      "creator": "Abby Thurman",
      "title": "What Are MSSPs and How Do They Fall Short?",
      "link": "https://www.reliaquest.com/blog/what-is-mssp/",
      "pubDate": "Tue, 31 May 2022 16:47:42 +0000",
      "content:encoded": "<p>As more and more companies look to outsourced solutions for their security needs, it’s important to be discerning about which ones you choose. They’re not all created equal, although many are useful. Let’s go over a popular option, MSSPs, and dive into what they do and <em>don’t</em> do, along with some alternatives, so that you can make your best choice.</p>\n<h2 id=\"whatis\">What Is an MSSP?</h2>\n<p>The definition of “managed security service provider” (MSSP) is pretty straightforward. An MSSP is a third party that helps companies monitor and manage their security environments.</p>\n<p>So how do they do it? They use high-availability security operations centers (SOCs). The SOC is the team responsible for monitoring a business&#8217;s environment for and responding to cyber threats.</p>\n<p>MSSP SOCs can offload your teams’ work, reducing the number of ops folks and other experts you need to train, and give you round-the-clock coverage with experts of their own. Or, they can help you build out and bolster your own security resources.</p>\n<h2 id=\"whatdo\">What Do MSSPs Do?</h2>\n<p>Now that we’ve got the basics on MSSPs, let’s get into their services. MSSPs can provide:</p>\n<ul>\n<li>Monitoring support. This can include virus and spam blocking, endpoint monitoring, firewalls, VPN management, and intrusion detection.</li>\n<li>Detection capabilities. MSSPs provide vulnerability risk assessment, threat intelligence, access control, and more.</li>\n</ul>\n<p><a href=\"https://www.techtarget.com/searchitchannel/definition/MSSP\" target=\"_blank\" rel=\"noopener\">As TechTarget states</a>, “MSSPs can also provide security recommendations and some level of continuous security, and they can develop policies to help protect a company’s infrastructure.” In addition, outsourcing these services is a cost-effective way to manage an ever-growing number of security threats, and saves you money on software, training, and an in-house team.</p>\n<h2 id=\"whatdont\">What Don&#8217;t MSSPs Do?</h2>\n<p>MSSPs do have their limitations. While there are obvious benefits to an outsourced SOC, that coverage comes at a price. MSSPs, unfortunately, do not:</p>\n<ul>\n<li>Support your existing security toolset. MSSPs typically have a set of tools they will integrate with. If your tools fall outside this list, you’re out of luck.</li>\n<li>Assist with response. An MSSP will send you a digest of alerts but will not provide additional context. It’s up to you to decipher the alerts and then act on them.</li>\n<li>Help you grow your security posture. An MSSP will help you fill the gaps you might have at a certain point in time, but they can’t help you build a roadmap for improving your security posture over time.</li>\n<li>Provide transparency. You won’t know what the MSSP team is doing in your environment. And since they don’t know it as well as you, that could lead to trouble.</li>\n</ul>\n<p>If these capabilities are important to you, you may want to look for an alternative option.</p>\n<h2 id=\"alternatives\">Alternatives to MSSPs</h2>\n<p>There are several security outsourcing options besides an MSSP, and many will provide you with more scope and greater actionability across your network. One of those options is a <a href=\"/managed-detection-and-response/\">managed detection and response</a> (MDR) solution.</p>\n<p>MDR includes “threat intelligence, threat hunting, security monitoring, incident analysis, and incident response.&#8221; Here are some key differences between <a href=\"/blog/mdr-vs-mssp-managed-security-services/\">MDR vs. MSSP</a>:</p>\n<ul>\n<li>Detection and response. While an MSSP will merely alert you when a security event is detected, an MDR service will investigate and respond to threats.</li>\n<li>Expertise. An MSSP won’t go through the trouble of sorting through your security alerts, leaving your already overburdened IT teams to sift through thousands of instances and false positives. MDR, on the other hand, does the heavy lifting of prioritizing those for you.</li>\n</ul>\n<p>While MDR provides more functionality than an MSSP, even MDR has its limitations. It might be more responsive than your general MSSPs, but it still is not agile enough for a shifting network environment that needs to find threats across multiple platforms, solutions, applications, and vendors, and many still suffer from a restrictive toolset. So, if MDR is better, what’s best?</p>\n<h2 id=\"reliaquest\">ReliaQuest Security Operations Platform</h2>\n<p>The <a href=\"/platform/\">ReliaQuest GreyMatter security operations platform</a> is built on an <a href=\"/open-xdr/\">Open XDR architecture</a>, which means it can go further and deeper than other managed service responders. What sets GreyMatter apart?</p>\n<ul>\n<li>Technology first: We’ll integrate with your existing tools</li>\n<li>Vendor agnostic: We support multi-vendor security tools to meet your specific needs</li>\n<li>Faster MTTD and MTTR: We provide faster detection, investigation, and response</li>\n<li>You see what we see: We are transparent, so you’ll always know what we’re doing</li>\n<li>Achieve cyber resilience: We’re dedicated to helping you grow your security posture</li>\n</ul>\n<p>ReliaQuest, using its GreyMatter platform paired with in-house security expertise, fills in the gaps MSSP and MDR leave behind. With ReliaQuest, you can have the staff-saving efficiency of an MSSP SOC with the platform-agnostic capabilities that can work across all your existing tooling.</p>\n<p>Combine technologies – SIEM, EDR, multi-cloud, third-party apps – for transparency, centralized visibility, and faster response environment-wide. If your organization plans to scale at the current rate of change, you need a security solution that’s powerful – and agile – enough to keep up.</p>\n",
      "content:encodedSnippet": "As more and more companies look to outsourced solutions for their security needs, it’s important to be discerning about which ones you choose. They’re not all created equal, although many are useful. Let’s go over a popular option, MSSPs, and dive into what they do and don’t do, along with some alternatives, so that you can make your best choice.\nWhat Is an MSSP?\nThe definition of “managed security service provider” (MSSP) is pretty straightforward. An MSSP is a third party that helps companies monitor and manage their security environments.\nSo how do they do it? They use high-availability security operations centers (SOCs). The SOC is the team responsible for monitoring a business’s environment for and responding to cyber threats.\nMSSP SOCs can offload your teams’ work, reducing the number of ops folks and other experts you need to train, and give you round-the-clock coverage with experts of their own. Or, they can help you build out and bolster your own security resources.\nWhat Do MSSPs Do?\nNow that we’ve got the basics on MSSPs, let’s get into their services. MSSPs can provide:\nMonitoring support. This can include virus and spam blocking, endpoint monitoring, firewalls, VPN management, and intrusion detection.\nDetection capabilities. MSSPs provide vulnerability risk assessment, threat intelligence, access control, and more.\nAs TechTarget states, “MSSPs can also provide security recommendations and some level of continuous security, and they can develop policies to help protect a company’s infrastructure.” In addition, outsourcing these services is a cost-effective way to manage an ever-growing number of security threats, and saves you money on software, training, and an in-house team.\nWhat Don’t MSSPs Do?\nMSSPs do have their limitations. While there are obvious benefits to an outsourced SOC, that coverage comes at a price. MSSPs, unfortunately, do not:\nSupport your existing security toolset. MSSPs typically have a set of tools they will integrate with. If your tools fall outside this list, you’re out of luck.\nAssist with response. An MSSP will send you a digest of alerts but will not provide additional context. It’s up to you to decipher the alerts and then act on them.\nHelp you grow your security posture. An MSSP will help you fill the gaps you might have at a certain point in time, but they can’t help you build a roadmap for improving your security posture over time.\nProvide transparency. You won’t know what the MSSP team is doing in your environment. And since they don’t know it as well as you, that could lead to trouble.\nIf these capabilities are important to you, you may want to look for an alternative option.\nAlternatives to MSSPs\nThere are several security outsourcing options besides an MSSP, and many will provide you with more scope and greater actionability across your network. One of those options is a managed detection and response (MDR) solution.\nMDR includes “threat intelligence, threat hunting, security monitoring, incident analysis, and incident response.” Here are some key differences between MDR vs. MSSP:\nDetection and response. While an MSSP will merely alert you when a security event is detected, an MDR service will investigate and respond to threats.\nExpertise. An MSSP won’t go through the trouble of sorting through your security alerts, leaving your already overburdened IT teams to sift through thousands of instances and false positives. MDR, on the other hand, does the heavy lifting of prioritizing those for you.\nWhile MDR provides more functionality than an MSSP, even MDR has its limitations. It might be more responsive than your general MSSPs, but it still is not agile enough for a shifting network environment that needs to find threats across multiple platforms, solutions, applications, and vendors, and many still suffer from a restrictive toolset. So, if MDR is better, what’s best?\nReliaQuest Security Operations Platform\nThe ReliaQuest GreyMatter security operations platform is built on an Open XDR architecture, which means it can go further and deeper than other managed service responders. What sets GreyMatter apart?\nTechnology first: We’ll integrate with your existing tools\nVendor agnostic: We support multi-vendor security tools to meet your specific needs\nFaster MTTD and MTTR: We provide faster detection, investigation, and response\nYou see what we see: We are transparent, so you’ll always know what we’re doing\nAchieve cyber resilience: We’re dedicated to helping you grow your security posture\nReliaQuest, using its GreyMatter platform paired with in-house security expertise, fills in the gaps MSSP and MDR leave behind. With ReliaQuest, you can have the staff-saving efficiency of an MSSP SOC with the platform-agnostic capabilities that can work across all your existing tooling.\nCombine technologies – SIEM, EDR, multi-cloud, third-party apps – for transparency, centralized visibility, and faster response environment-wide. If your organization plans to scale at the current rate of change, you need a security solution that’s powerful – and agile – enough to keep up.",
      "dc:creator": "Abby Thurman",
      "content": "As more and more companies look to outsourced solutions for their security needs, it’s important to be discerning about which ones you choose. They’re not all created equal, although many are useful. Let’s go over a popular option, MSSPs, and dive into what they do and don’t do, along with some alternatives, so that you [&#8230;]",
      "contentSnippet": "As more and more companies look to outsourced solutions for their security needs, it’s important to be discerning about which ones you choose. They’re not all created equal, although many are useful. Let’s go over a popular option, MSSPs, and dive into what they do and don’t do, along with some alternatives, so that you […]",
      "guid": "https://www.reliaquest.com/?p=4531",
      "categories": [
        "Security Operations Platform",
        "Threat Detection, Investigation, and Response",
        "Threat Hunting",
        "MDR"
      ],
      "isoDate": "2022-05-31T16:47:42.000Z"
    }
  ],
  "feedUrl": "https://www.reliaquest.com/blog/category/threat-hunting/feed/",
  "image": {
    "link": "https://www.reliaquest.com",
    "url": "https://www.reliaquest.com/wp-content/uploads/favicon-RGB-50x50.png",
    "title": "Threat Hunting – ReliaQuest",
    "width": "32",
    "height": "32"
  },
  "paginationLinks": {
    "self": "https://www.reliaquest.com/blog/category/threat-hunting/feed/"
  },
  "title": "Threat Hunting – ReliaQuest",
  "description": "Make Security Possible",
  "generator": "https://wordpress.org/?v=6.5.5",
  "link": "https://www.reliaquest.com",
  "language": "en-US",
  "lastBuildDate": "Thu, 22 Feb 2024 18:54:16 +0000"
}